xively/xively-client-c/examples/cc3200/xively_firmware_updates/SFT/xi_sft_client.c
/*  Copyright (c) 2003-2017, LogMeIn, Inc. All rights reserved.
    This is part of Xively C library. */

#include <xively.h>
#include <stdio.h>
#include <string.h>
#include <stdlib.h>
#include "../cbor/cbor.h"
#include "../cbor/cn-cbor/cn-cbor.h"
#include "../sha256/sha256.h"
#include "xi_sft.h"

/* Simpelink EXT lib includes */
#include "flc_api.h"

#include "hw_memmap.h"
#include "hw_common_reg.h"
#include "hw_types.h"
#include "hw_ints.h"
#include "interrupt.h"
#include "rom.h"
#include "rom_map.h"
#include "uart.h"
#include "prcm.h"
#include "utils.h"
#include "gpio.h"
#include "gpio_if.h"

#include "uart_if.h"
#define  UART_PRINT  Report
#undef   printf
#define  printf      Report

///// Test these individually
#define MAX_INCOMING_FILENAME_LENGTH 50
#define MAX_STRING_LENGTH 50

//
// TYPEDEFS
//
typedef unsigned char uchar;
typedef unsigned int uint;

typedef enum
{
    sft_status_ok = 0,                  /* 0 */
    sft_unsupported_protocol_version,   /* 1 */
    sft_open_file_error,                /* 2 */
    sft_close_file_error,               /* 3 */
    sft_write_error,                    /* 4 */
    sft_empty_length_array_error,       /* 5 */
    sft_data_out_of_bounds_error,       /* 6 */
    sft_missing_cbor_field_error,       /* 7 */
    sft_publish_error,                  /* 8 */
    sft_fingerprint_mismatch_error,     /* 9 */

    sft_status_max

} sft_status_t;

typedef struct file_download_ctx_s
{
    int file_length;
    int file_storage_offset;
    sft_status_t result;

    long file_handle;
    unsigned long file_token;

    char file_name[MAX_STRING_LENGTH];
    char file_revision[MAX_STRING_LENGTH];
    unsigned char file_sft_fingerprint_str[65];
    unsigned char file_local_computed_fingerprint[32];

    SHA256_CTX sha256_context;

} file_download_ctx_t;

typedef struct xi_sft_file_chunk_s
{
    uint offset;
    uint chunk_length;
    uint array_length;
    uint status;
    unsigned char* byte_array;
} xi_sft_file_chunk_t;

/*
 * VARIABLES
 */
int downloading = 0;

int tenpercent = 0;
int currenttenpercent = 0;

char firmware_filename[] = "firmware";
char firmware_revision[] = "1.0";

file_download_ctx_t download_context;

char buffer[400];

#define MESSAGESIZE 50
char message[MESSAGESIZE];
#define LOGDETAILSSIZE 400

/* Buffers to hold the formatted topics.
 * Topics are mangled by account and device ids.
 */
char xi_stopic[128];
char xi_logtopic[128];
char xi_ctopic[128];

const char* sft_status_strings[] =
{
    "sft_status_ok",                        /* 0 */
    "sft_unsupported_protocol_version",     /* 1 */
    "sft_open_file_error",                  /* 2 */
    "sft_close_file_error",                 /* 3 */
    "sft_write_error",                      /* 4 */
    "sft_empty_length_array_error",         /* 5 */
    "sft_data_out_of_bounds_error",         /* 6 */
    "sft_missing_cbor_field_error",         /* 7 */
    "sft_publish_error",                    /* 8 */
    "sft_fingerprint_mismatch_error",       /* 9 */

    "SFT_MAX_ERROR"
};



void xi_parse_file_update_available( xi_context_handle_t in_context_handle, cn_cbor *cb );


void xi_publish_file_info( xi_context_handle_t in_context_handle );
int xi_publish_file_chunk_request( xi_context_handle_t in_context_handle, const char* file_name, const char* file_revision, int offset );

void xi_process_file_chunk( xi_context_handle_t in_context_handle, cn_cbor* in_cb );
int xi_parse_file_chunk( cn_cbor* in_cb, xi_sft_file_chunk_t* out_sft_file_chunk );

void print_hash( unsigned char hash[] )
{
   int idx;
   for ( idx=0; idx < 32; idx++ )
   {
      printf( "%02x",hash[idx] );
   }
   printf( "\n" );
}

/* Reboot the device
 * This is invoked through a timed task from the xively client after the
 * file download is complete
 */
static void reboot_mcu( const xi_context_handle_t in_context_handle,
                        const xi_timed_task_handle_t timed_task_handle,
                        void* user_data )
{
  /* Configure hibernate RTC wakeup */
  PRCMHibernateWakeupSourceEnable( PRCM_HIB_SLOW_CLK_CTR );

  /* Delay loop */
  MAP_UtilsDelay( 8000000 );

  /* Set wake up time */
  PRCMHibernateIntervalSet( 330 );

  /* Request hibernate */
  PRCMHibernateEnter();

  /* Control should never reach here */
  while( 1 )
  {  }
}

/* Formats a message in the correct Xively Device Logs format and publishes it
 * to the device logs topic. Note that, due to the asynchronous behavior
 * of the client for the platform, this requires a few Xively ticks before
 * sending, so don't reboot immediately following a logged error!
 */
void publish_device_log( xi_context_handle_t context_handle, const char* message_str, const char* details_str, const sft_status_t status )
{
    static char* notice_str = "notice";
    static char* error_str = "error";

    if( NULL == message || NULL == details_str )
    {
        printf("\nWarning: publish_device_log invoked with a null string parameter\n\n");
        return;
    }

    if( sft_status_max <= status )
    {
        printf("\nWarning: publish_device_log invoked with an invalid status parameter\n\n");
        return;
    }

    const char* severity_str;
    if( sft_status_ok == status )
    {
        severity_str = notice_str;
    }
    else
    {
        severity_str = error_str;
    }

    char device_log_buffer[400];
#if 1
    printf("publish details string: %s\n", details_str);
    printf(".\n");
    printf("message string: %s\n", message_str );
    printf(".\n");
    printf("severity string: %s\n", severity_str);
    printf(".\n");
    printf("status code: %d\n", status );
    printf("sft_status_strings: %s\n", sft_status_strings[status] );
    printf(".\n");
    printf("details_str: %s\n", details_str );
    printf(".\n");
#endif

    snprintf( device_log_buffer, sizeof(device_log_buffer),
                  "{\"message\":\"%s\",\"severity\":\"%s\",\"code\":\"%d\",\"details\":\"%s: %s\"}",
                  message_str, severity_str, status, sft_status_strings[ status ], details_str );
    printf( "publishing device log: %s\n", device_log_buffer );

    xi_publish( context_handle, xi_logtopic, device_log_buffer, XI_MQTT_QOS_AT_MOST_ONCE, XI_MQTT_RETAIN_FALSE, NULL, NULL );
}

