xively/xively-client-c/examples/cc3200/xively_firmware_updates/SFT/xi_sft_client.c
                if( (unsigned int) cb_file->length < sizeof( download_context.file_revision ) )
                {
                    download_context.file_revision[cb_file->length] = '\0';
                }

                download_context.file_revision[sizeof(download_context.file_revision)-1] = '\0';
            }
            else
            {
                printf("No key called R\n");
                return;
            }

            // File 'S'ize
            cb_file = cn_cbor_mapget_string(cb_item, "S");
            if(cb_file)
            {
                printf( "FILE_UPDATE_AVAILABLE: file length = %d\n",cb_file->v.sint );
                download_context.file_length = cb_file->v.sint;
                tenpercent = download_context.file_length / 10;
                currenttenpercent = tenpercent;
            }
            else
            {
                printf("No key called S\n");
                return;
            }

            // File 'F'ingerprint
            cb_file = cn_cbor_mapget_string(cb_item, "F");
            if( cb_file )
            {
                printf( "Storing fingerprint: ");
                printf( "length: %d\n", cb_file->length );
                printf(" string: %s\n", cb_file->v.str );

                if( sizeof(download_context.file_sft_fingerprint_str) - 1 < cb_file->length )
                {
                    /* TODO:
                     * log error
                     * set error flag for downoading state */
                }
                else
                {
                    memset( download_context.file_sft_fingerprint_str, '\0',
                            sizeof( download_context.file_sft_fingerprint_str ) );
                    strncpy( download_context.file_sft_fingerprint_str, cb_file->v.str, cb_file->length );
                }
            }
            else
            {
                printf("No key called F\n");
                return;
            }
        }
        else
        {
            printf("No item at index %d\n",i);
            return;
        }
    }

    /* Log the FILE_UPDATE_AVAILABLE information */
    {
        char log_details_str[LOGDETAILSSIZE];
        snprintf( log_details_str, sizeof( log_details_str ), "name=%s revision=%s length = %d",
                  firmware_filename, download_context.file_revision, download_context.file_length );
        publish_device_log( in_context_handle, "File update available", log_details_str, sft_status_ok );
    }

    /* Set Download State to Active */
    downloading = 1;

    /* Send the Chunk Request */
    xi_state_t xi_state = xi_publish_file_chunk_request( in_context_handle, firmware_filename, download_context.file_revision,
                                                               download_context.file_storage_offset );

    /* Fetch the initial chunk of the file */
    if( XI_STATE_OK != xi_state )
    {
        /* Warning: the likelihood that the following Device Logs publish works after the previous
         * publish failing its quite slim. */
        char log_details[LOGDETAILSSIZE];
        snprintf( log_details, LOGDETAILSSIZE,"error publishing GET_FILE_CHUNK request. xi_status c client code: %d", xi_state );
        publish_device_log( in_context_handle, "GET_FILE_CHUNK error. ", log_details, sft_fingerprint_mismatch_error );

        downloading = 0;
        download_context.result = sft_publish_error;
    }
}

/*
 * Formats a FILE_GET_CHUNK cbor message with the provided parameters and then publishes
 * the message to the SFT Service.
 *
 * Returns 0 on success, or -1 if the message could not be queued for publication
 * (probably due to a too-small encoding buffer)
 */
int xi_publish_file_chunk_request( xi_context_handle_t in_context_handle, const char* file_name, const char* file_revision, int offset )
{
    const int message_type = XI_FILE_GET_CHUNK;
    const int message_version = 1;
    const int chunk_length = 1024;

#if 0
    printf( "XI_FILE_GET_CHUNK request params: " );
    printf( "N: \"%s\", ", file_name );
    printf( "R: \"%s\", ", file_revision );
    printf( "O: %d, ", offset );
    printf( "L: %d\n", chunk_length );
#endif

    /* Format a CBOR message of the FILE_GET_CHUNK message type. */
    cn_cbor_errback err;
    cn_cbor *cb_map = cn_cbor_map_create(&err);

    cn_cbor_map_put( cb_map, cn_cbor_string_create( "msgtype", &err ),
                     cn_cbor_int_create( message_type, &err ), &err );

    cn_cbor_map_put( cb_map, cn_cbor_string_create( "msgver", &err ),
                     cn_cbor_int_create( message_version, &err ), &err );

    cn_cbor_map_put( cb_map, cn_cbor_string_create( "N", &err ),
                     cn_cbor_string_create( file_name, &err ), &err);

    cn_cbor_map_put( cb_map, cn_cbor_string_create( "R", &err ),
                     cn_cbor_string_create( file_revision, &err ), &err);

    cn_cbor_map_put( cb_map, cn_cbor_string_create("O", &err ),
                     cn_cbor_int_create(offset, &err ), &err );

    cn_cbor_map_put( cb_map, cn_cbor_string_create("L", &err ),
                     cn_cbor_int_create(chunk_length, &err ), &err );

    unsigned char encoded_cbor_msg[128];
    ssize_t encoded_size = cn_cbor_encoder_write( encoded_cbor_msg, 0, sizeof( encoded_cbor_msg ), cb_map );
    cn_cbor_free( cb_map CBOR_CONTEXT_PARAM );

    if( 0 >= encoded_size )
    {
        printf("Could not encode the FILE_CHUNK request in the specified buffer\n");
        return -1;
    }

    if( 0 != xi_publish_data( in_context_handle, xi_stopic, encoded_cbor_msg, encoded_size,
                                         XI_MQTT_QOS_AT_MOST_ONCE, XI_MQTT_RETAIN_FALSE, NULL, NULL ) )
    {
        printf("Xively Publish returned an error\n");
        return -1;
    }

    return 0;
}

/* Process the cbor object as a FILE_CHUNK message, calling xi_parse_file_chunk to extract the
 * cbor fields and then acting on them to store the data into the flash file system's
 * firmware image file.  If there is more to be downloaded then a subsequent
 * GET_CHUNK request is formatted and published.
 */
void xi_process_file_chunk( xi_context_handle_t in_context_handle, cn_cbor *cb )
{
    xi_sft_file_chunk_t file_chunk_data;
    if( 0 != xi_parse_file_chunk( cb, &file_chunk_data ) )
    {
        download_context.result = -1;
        downloading = 0;
        return;
    }

    /* printf( "---- FILE_CHUNK: length = %d FILE_LENGTH: %d\n", file_chunk_data.chunk_length, download_context.file_length ); */

