xively/xively-client-c/examples/cc3200/xively_firmware_updates/SFT/xi_sft_client.c
    /* Ensure that this chunk starts where we left off. */
    if( download_context.file_storage_offset != file_chunk_data.offset )
    {
        /* TODO: Report error to SFT
         * TODO: Report error to Device Logs */
        printf("ERROR: unexpected Chunk Offset Delivered by SFT!\n");
        printf("  expected: %d  sft chunk offset: %d\n", download_context.file_storage_offset, file_chunk_data.offset );
        download_context.result = -1;
        downloading = 0;
    }

    /* Track Progress */
    if( currenttenpercent < file_chunk_data.offset )
    {
        printf("Downloaded %d bytes %d %%  of the file \n", download_context.file_storage_offset,
                 (100 * (currenttenpercent + 1000) ) / download_context.file_length );
        currenttenpercent += tenpercent;
    }

    /* Ensure that we have a buffer to write from */
    if( file_chunk_data.array_length )
    {
        /* convert from unsigned to signed becuase TI's API has a signed length variable */
        if( file_chunk_data.offset + file_chunk_data.array_length > download_context.file_length )
        {
            /* Request to write past the file length
             * TODO: Report error to SFT
             * TODO: Report error to Device Logs */
            downloading = 0;
        }

        /* update the SHA256 digest with the provided data */
        sha256_update( &download_context.sha256_context, (unsigned char *) file_chunk_data.byte_array, file_chunk_data.array_length );

        int write_length = (int) file_chunk_data.array_length;
        if( 0 == write_length )
        {
            /* TODO: check the status code
             * TODO: Report error to SFT
             * TODO: Report error to Device Logs */
            downloading = 0;
        }

        if( 0 > write_length )
        {
            /* Negative values means that we lost data in the unsigned -> signed conversion.
             * TODO: Report error to SFT
             * TODO: Report error to Device Logs */
            printf("ERROR: WriteBuffer is too large for CC3200 sl_extlib_FlcWriteFile operations\n");
            downloading = 0;
            download_context.result = -1;
        }
        else
        {
            int bytes_written = sl_extlib_FlcWriteFile( download_context.file_handle, file_chunk_data.offset,
                                                        (unsigned char *) file_chunk_data.byte_array, write_length );
            if( 0 >= bytes_written )
            {
                /* Write Failed
                 * TODO: Report error to SFT
                 * TODO: Report error to Device Logs */
                printf("ERROR: Write Returned error code: %d\n", bytes_written );
                download_context.result = -1;
                downloading = 0;
            }
            else
            {
                /* Track our progress through the file */
                download_context.file_storage_offset = file_chunk_data.offset + bytes_written;

                /* Check for completeness */
                if( download_context.file_storage_offset >= download_context.file_length )
                {
                    /* Download Complete */
                    downloading = 0;
                }
            }
        }
    }
    else
    {
        /* Zero Length Write Buffer
         * TODO: check for status of 1 for EoF
         * TODO: Report error to SFT
         * TODO: Report error to Device Logs */
        printf("ERROR: Write Buffer from SFT is of zero length\n" );
        download_context.result = -1;
        downloading = 0;
    }

    /* TODO: check for status of 1 for EoF */
    if( file_chunk_data.status > 1 )
    {
        printf("ERROR: SFT packet reported Chunk Status Request Error: %d\n", file_chunk_data.status );

        /* TODO: Report error to SFT
         * TODO: Report error to Device Logs */
        download_context.result = -1;
        downloading = 0;
    }

    if( 1 == downloading )
    {
        /* If still download  continuing, create another FILE_CHUNK request to the SFT service */
        xi_publish_file_chunk_request( in_context_handle, firmware_filename,
                                           download_context.file_revision, download_context.file_storage_offset );
    }
}

/* Parses the CBOR message to get the FILE_CHUNK required FILE_CHUNK fields
 * and places the data in the out_sft_file_chunk structure
 * Returns 0 on success, or -1 if there are missing fields or null parameters
 */
int xi_parse_file_chunk( cn_cbor* in_cb, xi_sft_file_chunk_t* out_sft_file_chunk )
{
    if( NULL == in_cb || NULL == out_sft_file_chunk )
    {
        return -1;
    }

    /* use the RED LED to signal downloading progress */
    static int ledToggle = 0;
    ledToggle = ( ledToggle + 1 ) % 2;
    if( ledToggle )
    {
        GPIO_IF_LedOn( MCU_RED_LED_GPIO );
    }
    else
    {
        GPIO_IF_LedOff( MCU_RED_LED_GPIO );
    }

    cn_cbor *cb_item = NULL;
    memset( out_sft_file_chunk, 0, sizeof(xi_sft_file_chunk_t) );

    /* msg version */
    cb_item = cn_cbor_mapget_string( in_cb, "msgver" );
    if(cb_item)
    {
        if( 1 != cb_item->v.uint )
        {
            printf( "FILE_CHUNK unsupported message version: %d\n", cb_item->v.uint );
            return -1;
        }
    }
    else
    {
       printf( "FILE_CHUNK message missing message version field\n" );
       return -1;
    }

    /* chunk offset */
    cb_item = cn_cbor_mapget_string( in_cb, "O" );
    if( cb_item )
    {
       out_sft_file_chunk->offset = cb_item->v.uint;
    }
    else
    {
        printf("FILE_CHUNK message missing offset field\n");
        return -1;
    }

    /* chunk length */
    cb_item = cn_cbor_mapget_string( in_cb, "L" );
    if( cb_item )
    {
        out_sft_file_chunk->chunk_length = cb_item->v.uint;
    }
    else
    {
        printf( "FILE_CHUNK message missing length field\n" );
        return -1;
    }

    /* Status */
    cb_item = cn_cbor_mapget_string( in_cb, "S" );
    if( cb_item )
    {
        out_sft_file_chunk->status = cb_item->v.uint;
    }
    else
    {
        printf( "FILE_CHUNK message missing status field\n" );
        return -1;
    }

